app/Http/Controllers/SptController.php

    public function index()
    {


        $kirim['pegawais'] = Pegawai::where('status', 1)->orderBy('nama', 'ASC')->get();
        $kirim['penandatangans'] = PenandatanganSpt::where('status', 1)->get();
        $kirim['spts'] = Spt::with('pegawaispt')->get();
---
select * from `pegawais` where `status` = 1 order by `nama` asc
select * from `penandatangan_spts` where `status` = 1
select * from `pegawai_spts` where `pegawai_spts`.`spt_id` in ('9a672a4b-8c37-4417-9984-d2ce15bac1f8')
select * from `spts` limit 1

    public function create(Request $request)
    {
        $request->validate(
            [
                'no_surat' => 'required',
                'judul' => 'required',

            ],
            [
                'no_surat.required' => "No. Surat Harus Di Isi",
                'judul.required' => "Kegiatan Harus Di Isi",
            ]
        );

        $create_spt = [
            'no_surat' => $request->no_surat,
            'judul' => $request->judul,
            'berangkat' => $request->berangkat,
            'tgl' => $request->tgl_spt,
            'penandatanganspt_id' => $request->penandatangan,
        ];
        if ($request->pulang == null) {
            $create_spt['pulang'] = $request->berangkat;
        } else {
            $create_spt['pulang'] = $request->pulang;
        }
        $spt = Spt::create($create_spt);
---
insert into `spts` (`no_surat`, `judul`, `berangkat`, `tgl`, `penandatanganspt_id`, `pulang`, `id`, `updated_at`, `created_at`) values ('090/       /405.19/2023', 'Pendistribusian, Sosialisasi dan Pelatihan Pengelolaan Email @ponorogo.go.id serta Analisis Sistem Informasi Persuratan Desa Pupus', '2023-05-09', '2023-05-05', '99e4e63b-dc19-45ac-8d84-1cc5fde4d385', '2023-05-09', '9a673814-b816-423a-b0f0-bc2c99594ce0', '2023-10-19 09:05:31', '2023-10-19 09:05:31')


        $jml_pegawai = count($request->pegawai);
        for ($i = 0; $i < $jml_pegawai; $i++) {
            Pegawaispt::create([
                'pegawai_id' =>  $request->pegawai[$i],
                'spt_id' => $spt->id
            ]);
---
insert into `pegawai_spts` (`pegawai_id`, `spt_id`, `updated_at`, `created_at`) values ('99e4e63b-dd82-4bc1-a5f8-a3068cf85985', '9a673814-b816-423a-b0f0-bc2c99594ce0', '2023-10-19 09:05:31', '2023-10-19 09:05:31')