app/Http/Controllers/WordController.php

    public function index(Request $request, Spt $data)
    {
        $pegawaispts = Spt::with(['pegawaispt', 'penandatanganspt.pegawai'])->where('id', $data->id)->first();
---
select * from `pegawai_spts` where `pegawai_spts`.`spt_id` in ('9a673814-b816-423a-b0f0-bc2c99594ce0')
select * from `pegawais` where `pegawais`.`id` in ('99e4e63b-dc19-45ac-8d84-1cc5fde4d123')
select * from `penandatangan_spts` where `penandatangan_spts`.`id` in ('99e4e63b-dc19-45ac-8d84-1cc5fde4d385')
select * from `spts` where `id` = '9a673814-b816-423a-b0f0-bc2c99594ce0' limit 1